import React from 'react'

export const HomePageContent = {
  title:
    "ПРОЕКТИРОВАНИЕ ТЕХНОЛОГИЧЕСКИХ ПРОЦЕССОВ ИЗГОТОВЛЕНИЕ СВАРНЫХ КОНСТРУКЦИЙ",
  fgos: "Сварщик ручной и частично механизированной сварки(наплавки)",
  fgosNum: "ФГОС СПО 15.01.05",
  mdk: "Технология производства сварных конструкций",
  mdkNum: "МДК 01.02",
  theme:
    "ПРОЕКТИРОВАНИЕ ТЕХНОЛОГИЧЕСКИХ ПРОЦЕССОВ ИЗГОТОВЛЕНИЕ СВАРНЫХ КОНСТРУКЦИЙ",

  infoContent: {
    info: (
      <>
        <h2 className="text-2xl text-black font-bold mt-4">ФГОС СПО:</h2>
        <p className="text-lg text-black mb-2">
          Федеральный государственный образовательный стандарт среднего
          профессионального образования по профессии 15.01.05 Сварщик ручной и
          частично механизированной сварки (наплавки) (утв. приказом
          Министерства образования и науки РФ от 29 января 2016 г. N 50) <br />{" "}
          15.00.00 Машиностроение <br />
          15.01.05 Сварщик ручной и частично механизированной сварки (наплавки)
        </p>

        <h2 className="text-2xl text-black font-bold mt-4">
          ПОП-П:
        </h2>
        <p className="text-lg text-black mb-2">15.01.05 Сварщик ручной и частично механизированной сварки (наплавки)</p>

        <h2 className="text-2xl text-black font-bold mt-4">
          Профессиональный модуль:
        </h2>
        <p className="text-lg text-black mb-2">
          ПМ 01. Подготовительно-сварочные работы и контроль качества сварных швов после сварки.
        </p>

        <h2 className="text-2xl text-black font-bold mt-4">МДК 01.02:</h2>
        <p className="text-lg text-black mb-2">
        Основные сведения о производстве сварных конструкций.
        </p>

        <h2 className="text-2xl text-black font-bold mt-4">
          Наименование раздела:
        </h2>
        <p className="text-lg text-black mb-2">
          Технология производства сварных конструкций.
        </p>

        <h2 className="text-2xl text-black font-bold mt-4">
          Наименование темы:
        </h2>
        <p className="text-lg text-black mb-2">
          Проектирование технологических процессов изготовление сварных
          конструкций.
        </p>
      </>
    ),
    keyWords: (
      <>
        <h2 className="text-xl  text-black  mb-2">
          {" "}
          <p className="text-lg text-black">
          <b>Технологический процесс </b> - часть производственного процесса, во
          время которого происходит изменение качественного состояния объекта,
          изменение формы и размеров заготовки, свойств металла (материала или
          полуфабриката).
          </p>
        </h2>

        <h2 className="text-xl text-black mb-2">
          <b>Производственный процесс </b> - это этапы, которые проходят
          предметы на пути их превращения в изделия или готовую машину.
        </h2>

        <h2 className="text-xl text-black  mb-2">
          <b>Операция </b> - законченная часть технологического процесса,
          выполненная на рабочем месте (например, резка, сборка, сварка).
        </h2>

        <h2 className="text-xl text-black mb-2">
          <b>Рабочее место </b>- часть площади цеха, предназначенная для работы
          одного рабочего или группы рабочих, на которой размещено
          технологическое оборудование, инструмент, подъёмно-транспортное
          устройство, стеллажи для хранения заготовок, деталей.
        </h2>

        <h2 className="text-xl text-black  mb-2">
          <b>Рабочая позиция </b> - каждое новое положение установленного узла
          вместе с приспособлением.
        </h2>
        <h2 className="text-xl text-black  mb-2">
          <b>Трудоемкость </b>- количество времени, затрачиваемое на выполнение
          технологического процесса или его части.
        </h2>

        <h2 className="text-xl text-black  mb-2">
          <b>Единичное, индивидуальное производство </b> - производство, при
          котором изделия изготавливаются в единичных экземплярах, разнообразные
          по конструкции и размерам.
        </h2>
      </>
    ),
  },
};
