import React from 'react';

import { i1, i10, i11, i12, i2, i3, i4 ,i5 ,i6, i7, i8, i9 } from '../../assets/base64/infogragic';

export const InfographicPageContent = {
  title:
    'Понятие технологического процесса',
  subtitle:
    'Изучите материал об организации технологического процесса изготовления сварных конструкций. чтобы перейти к учебному материалу, кликните на каждую из иконок.',

  items: [
    {
      id: 0,
      title: 'Понятия технологических процессов',
      titleImage: (
        
    <img width={90} src={i1} />
      ),
      content: (
        <>
          <p className='mb-4'>
            <b>Производственный процесс</b> – это этапы, которые проходят
            предметы на пути их превращения в изделия или готовую машину.
          </p>
          <p className='mb-4'>
            <b>Технологический процесс</b> – часть производственного процесса,
            во время которого происходит изменение качественного состояния
            объекта, изменение формы и размеров заготовки, свойств металла
            (материала или полуфабриката).
          </p>
          <p className='mb-4'>
            <b>Рабочее место</b> – часть площади цеха, предназначенная для
            работы одного рабочего или группы рабочих, на которой размещено
            технологическое оборудование, инструмент, подъёмно-транспортное
            устройство, стеллажи для хранения заготовок, деталей.
          </p>
          <p className='mb-4'>
            <b>Операция</b> – законченная часть технологического процесса,
            выполненная на рабочем месте (например, резка, сборка, сварка).
          </p>
          <p className='mb-4'>
            <b>Переход</b> – часть технологической операции (применительно к
            сварке, например, поворот сварной конструкции в кантователе для
            сварки очередных швов в нижнем положении).
          </p>
          <p className='mb-4'>
            <b>Рабочая позиция</b> – каждое новое положение установленного узла
            вместе с приспособлением.
          </p>
          <p className='mb-4'>
            <b>Трудоемкость</b> – количество времени, затрачиваемое на
            выполнение технологического процесса или его части.
          </p>
          <p className='mb-4'>
            <b>Серия</b> – количество изделий или машин, подлежащих изготовлению
            по постоянному, неизменяемому чертежу.
          </p>
          <p className='mb-4'>
            <b>Единичное, индивидуальное производство</b> – производство, при
            котором изделия изготавливаются в единичных экземплярах,
            разнообразные по конструкции и размерам.
          </p>
          <p className='mb-4'>
            <b>Серийное производство</b> – производство, при котором
            изготовление изделий, производится партиями или сериями, состоящими
            из одноименных, однотипных по конструкции и одинаковых по размерам
            изделий, запускаемых в производство одновременно.
          </p>
          <p className='mb-4'>
            <b>Массовое производство</b> – производство, при котором большое
            количество одинаковых изделий изготовляется путём непрерывного
            выполнения на рабочих местах одних и тех же постоянно повторяющихся
            операций.
          </p>
        </>
      ),
    },
    {
      id: 1,
      title: 'Виды  производства',
      titleImage: (
        <img width={90} src={i2} />
      ),
      content: (
        <>
          <p className='mb-4'>
            <b>Единичное, индивидуальное производство</b> – производство, при
            котором изделия изготавливаются в единичных экземплярах,
            разнообразные по конструкции и размерам.
          </p>
          <p className='mb-4'>
            <b>Серийное производство</b> – производство, при котором
            изготовление изделий, производится партиями или сериями, состоящими
            из одноименных, однотипных по конструкции и одинаковых по размерам
            изделий, запускаемых в производство одновременно.
          </p>
          <p className='mb-4'>
            <b>Массовое производство</b> – производство, при котором большое
            количество одинаковых изделий изготовляется путём непрерывного
            выполнения на рабочих местах одних и тех же постоянно повторяющихся
            операций.
          </p>
          <p className='mb-4'>
            В зависимости от назначения изделия делятся на изделия основного и
            вспомогательного производства. Изделия основного производства
            предназначены для поставки заказчику вне данного предприятия.
            Изделия вспомогательного производства предназначены только для
            собственных нужд предприятия, которое их изготавливает.
          </p>
          <p className='mb-4'>
            Вначале предприятие изучает рынок спроса на изделие, его
            потребительские свойства, либо получает заказ на изготовление
            сварных изделий или конструкций. Затем предприятие выполняет опытно-
            конструкторские, научно-исследовательские и технологические работы
            по проектированию сварного изделия и технологии изготовления этого
            изделия. Почти в это же время осуществляется конструкторская и
            технологическая подготовка производства.
          </p>
        </>
      ),
    },
    {
      id: 2,
      title: 'Понятие технологической подготовки производства',
      titleImage: (
        <img width={90} src={i3} />

      ),
      content: (
        <>
          <p className='mb-4'>
            Конструкторская подготовка производства включает в себя разработку
            конструкции сварного изделия и создание соответствующей технической
            документации (чертежей, спецификаций и т.д.). Технологическая
            подготовка производства состоит в создании технологических процессов
            сборки изделия и изготовления его деталей, разработке конструкций и
            изготовлении сборочных и сварочных приспособлений и другой
            технологической оснастки с оформлением соответствующей документации.
          </p>
          <p className='mb-4'>
            Параллельно с конструкторско-технологической подготовкой
            производства изготавливается опытный образец сварного изделия,
            проводится контроль и его испытания, а также осуществляются, при
            необходимости, научно-исследовательские работы с целью
            совершенствования конструкции опытного образца и технологии
            сварочного производства. После завершения конструкторско-
            технологической подготовки производства начинается выполнение заказа
            или серийный выпуск сварного изделия.
          </p>
          <p className='mb-4'>
            Исключительное разнообразие сварных изделий и конструкций затрудняет
            их единую классификацию. Их можно классифицировать по методу
            получения заготовок (листовые, сварнолитые, кованосварные,
            штампосварные конструкции); по целевому назначению (строительные,
            вагонные, судовые, авиационные, газо- и нефтехранилища и др.).
          </p>
          <p className='mb-4'>
            При рассмотрении вопросов проектирования и изготовления сварные
            конструкции целесообразно классифицировать в зависимости от
            характерных особенностей их работы. В этом случае можно выделить
            следующие типы сварных элементов и строительных конструкций: балки —
            конструктивные элементы, работающие, в основном, на поперечный
            изгиб.
          </p>
          <p className='mb-4'>
            Жестко соединенные между собой балки образуют рамные конструкции;
            колонны — элементы, работающие преимущественно на сжатие, или сжатие
            с продольным изгибом; решетчатые конструкции.
          </p>
          <img src={i9} />
          <p className='my-2'>
            <i>Жизненный цикл сварного изделия (рис. 1)</i>
          </p>
          <p className='mb-4'>
            Изготовление сварных металлоконструкций представляет собой, как
            правило, сложный комплекс технологических процессов с большим числом
            сборочных, сварочных и других операций, при которых такие вопросы,
            как транспортирование сварных конструкций, базирование их деталей в
            процессе сборки и т. п., решаются подчас сложнее, чем, скажем, при
            станочной обработке заготовок. Сварная конструкция собирается часто
            из значительного числа деталей, различающихся по химическому составу
            конструкционных материалов. При сварке изменяются свойства металла в
            зоне термического воздействия, возникают деформации и
            технологические остаточные напряжения, что в ряде случаев может
            оказать неблагоприятное влияние на прочность сварной конструкции.
            Поэтому при проектировании технологических процессов изготовления
            сварных конструкций наряду с изложенными применительно к сборке
            особенностями следует учитывать ряд специфических требований, для
            чего руководствоваться указанными ниже соображениями.
          </p>
          <p className='mb-4'>
            <b>
              Изготовление сварных конструкций включает в общем случае следующие
              работы:
            </b>
          </p>
          <ul className='list-decimal pl-4 mb-4 list-inside'>
            <li>контроль качества конструкционных и сварочных материалов;</li>
            <li>
              очистку листовой стали, литых, штампованных и других заготовок,
              являющихся составными частями сварной конструкции;
            </li>
            <li>
              заготовительные операции: правку, разметку, резку, подготовку
              кромок, гибку и т. п.;
            </li>
            <li>сборку и сварку конструкции;</li>
            <li>устранение технологических остаточных деформаций;</li>
            <li>термическую обработку сварной конструкции;</li>
            <li>механическую обработку резанием;</li>
            <li>общий контроль и испытания сварной конструкции;</li>
            <li>окраску и маркирование.</li>
          </ul>
          <p>
            Вследствие неравномерного нагрева и охлаждения металла в процессе
            сварки, литейной усадки расплавленного металла шва и структурных
            изменений в зоне термического влияния в сварных конструкциях
            возникают технологические напряжения и деформации.{' '}
          </p>
        </>
      ),
    },
    {
      id: 3,
      title: 'Этапы технологической подготовки производства',
      titleImage: (
        <img width={90} src={i4} />

      ),
      content: (
        <>
          <p className='mb-4'>
            Технологическая подготовка — это трудоемкий процесс, состоящий их
            нескольких этапов.
          </p>
          <p className='mb-4'>
            <b>1.Проработка рабочей конструкции на технологичность</b>
          </p>
          <p className='mb-4'>
            Понятие технологичность подразумевает экономичность изготовления
            продукции в имеющихся условиях при соблюдении необходимых объемов
            выпуска. Цель проработки на технологичность заключается в том, чтобы
            выявить недостатки конструкции, и возможности ее улучшения.
          </p>
          <p className='mb-4'>
            Технологичность характеризуется ресурсосберегающими показателями,
            которые должны способствовать достижению оптимальных затрат. К ним
            относятся показатели использования ресурсов — трудоемкость,
            материалоемкость, а также технологическая себестоимость, отражающая
            расход различных видов ресурсов в целом в стоимостном выражении.
          </p>
          <p className='mb-4'>
            <b>2.Определение межцеховых маршрутов</b>
          </p>
          <p className='mb-4'>
            Создание межцеховых маршрутов подразумевает определение
            последовательности прохождения заготовок и сборочных единиц по
            подразделениям и производственным участкам для получения требуемой
            номенклатурной позиции.
          </p>
          <p className='mb-4'>
            Допустимые межцеховые маршруты определяются на основе анализа
            имеющегося оборудования, применяемых методов обработки и получения
            заготовок. Они содержат обобщенные данные без детализации конкретных
            операций. Основная задача этого этапа заключается в оптимизации
            прохождения заготовок по цехам.
          </p>
          <p className='mb-4'>
            <b>3.Разработка маршрутно-операционных процессов</b>
          </p>
          <p className='mb-4'>
            На этом уровне проектирования определяются маршруты движения
            заготовок и сборочных единиц внутри подразделений и технология их
            изготовления на конкретные видах оборудования.
          </p>
          <p className='mb-4'>
            В маршрутах отражается детальная информация об операциях, которые
            должны выполняться в каждом производственном подразделении.
            Указываются используемые рабочие центры, перечень действий,
            выполняемых на рабочих местах, режимы работы оборудования, а также
            последовательность операций и нормативы временных затрат на их
            выполнение.
          </p>
          <p className='mb-4'>
            В разных вариантах технологических процессов используются различные
            заготовки, станки и оснастка, что влияет на показатели трудоемкости,
            производительности, а также на требования, предъявляемые к
            квалификации работников. При определении оптимального варианта
            процесса в первую очередь учитываются себестоимость и
            производительность.
          </p>
          <p className='mb-4'>
            <b>4.Нормирование материальных расходов</b>
          </p>
          <p className='mb-4'>
            Под нормой расхода материальных ресурсов подразумевают их
            количество, требующееся для производства заготовок и конечного
            изделия. В состав нормы включают полезный расход, отходы и потери
            материалов. Норма расхода материальных ресурсов оказывает влияние на
            величину затрат и себестоимость продукции.
          </p>
          <p className='mb-4'>
            <b>5.Разработка методов технического контроля</b>
          </p>
          <p className='mb-1'>
            Технический контроль разрабатывают в виде операций и процессов,
            которые охватывают все этапы производства:
          </p>
          <p className='mb-1'>
            входному контролю подлежат сырье, материалы и комплектующие,
            поступающие от поставщиков для изготовления продукции;
          </p>
          <p className='mb-1'>
            операционный контроль подразумевает отслеживание качества заготовок
            и соблюдения техпроцесса во время выполнения операций или после их
            завершения;
          </p>
          <p className='mb-4'>
            приемочный контроль проводится для проверки качества готовой
            продукции.
          </p>
          <p className='mb-4'>
            <b>6.Проектирование оснастки</b>
          </p>
          <p className='mb-4'>
            На этом этапе проектируется оснастка, которая предназначена для
            проведения работ по обработке и сборке, а также для осуществления
            функций контроля качества деталей и изделий. Проектирование должно
            обеспечить наиболее эффективную конструкцию оснастки с экономической
            точки зрения и с точки зрения достижения заданной точности.
          </p>
          <p className='mb-4'>
            <b>7.Планирование технологической подготовки</b>
          </p>
          <p className='mb-4'>
            Планирование — это основа эффективного управления подготовкой. Оно
            позволяет обеспечить не только сокращение ее цикла, но и
            трудоемкости выполнения отдельных стадий.
          </p>
          <p className='mb-4'>
            Автоматизация планирования технологической подготовки производства
            проводится с использованием систем PLM, которые позволяют
            формировать долгосрочные и краткосрочные планы, устанавливать
            исполнителей, сроки выполнения задач, а также предоставляют данные
            для разработок и помогают отслеживать ход выполнения работ.
          </p>
          <p className='mb-4'>
            Все технологические, а также конструкторские данные системы PLM
            передают на следующий этап, где происходит планирование
            производства. За автоматизацию этих процессов отвечает система
            Adeptik APS, которая планирует наиболее оптимальные в текущих
            производственных условиях режимы выполнения операций и их
            последовательность, обеспечивая минимальное количество переналадок,
            соблюдение норм трудозатрат и расхода материальных ресурсов,
            повышение производительности и эффективности производства.
          </p>
        </>
      ),
    },
    {
      id: 4,
      title: 'Задачи технологической подготовки производства',
      titleImage: (
        <img width={90} src={i5} />

      ),
      content: (
        <>
          <p className='mb-4'>
            {' '}
            <b>Обработка конструкции изделия и деталей на технологичность.</b>
            Проводится перед разработкой технологических процессов, основные
            объекты: материалы, рациональность конструкций, сборки и т.п.
          </p>{' '}
          <p className='mb-4'>
            {' '}
            <b>Разработка межцеховых технологических маршрутов (расцеховка).</b>
            Распределение деталей и узлов между цехами и участками по
            последовательности видов обработки (литейные, кузнечные, сварочные,
            механообработка и т.д.).
          </p>{' '}
          <p className='mb-4'>
            {' '}
            <b>Разработка межцеховых технологических маршрутов (расцеховка).</b>
            Распределение деталей и узлов между цехами и участками по
            последовательности видов обработки (литейные, кузнечные, сварочные,
            механообработка и т.д.).
          </p>{' '}
          <p className='mb-4'>
            {' '}
            <b>Разработка технологических процессов</b>, т.е. содержания и
            последовательности выполнения операций при изготовлении объектов.
            При этом в зависимости от типа производства, проводится
            соответствующая детализация элементов технологического процесса. При
            разработке технологических процессов учитывается возможность
            унификации процессов: типовой или групповой обработки.{' '}
            <i>Типовая унификация</i> предусматривает общность пооперационного
            маршрута обработки ряда деталей
            (токарная-токарная-шлифовальная-фрезерная-сверлильная).{' '}
            <i>Групповая унификация</i> предусматривает группировку деталей по
            общности обрабатываемых поверхностей, базирования и т.п., создание
            специальной групповой оснастки.
          </p>{' '}
          <p className='mb-4'>
            {' '}
            <b>Установление пооперационных норм времени.</b> Нормы
            устанавливаются обычно технологом-нормировщиком, который в
            зависимости от типа и условий производства может устанавливать один
            из видов норм:
            <p>нормативные (справочники по нормированию);</p>
            <p>расчетно-аналитические;</p>
            <p>опытно-статистические (накопительные статистические данные).</p>
          </p>{' '}
          <p className='mb-4'>
            {' '}
            <b>
              Установление норм расхода материалов на деталь или узел (сборка).
            </b>
            <p>
              <i>
                Проектирование и изготовление средств технологического оснащения
              </i>{' '}
              , включая специальные обрабатывающие и измерительные инструменты
              (приспособления, кондукторы, штампы, пресс-формы, инструменты и
              т.д.).
            </p>
          </p>{' '}
          <p className='mb-4'>
            {' '}
            <b>
              Отладка и внедрение в производство разработанных технологических
              процессов.
            </b>
            <p>
              Решаются две главные задачи: процесс освоения нового производства;
              проверка соответствия: выбранного оборудования, оснастки,
              инструмента и его количественной потребности, измерительного
              инструмента, потребности площадей и людских ресурсов.
            </p>
          </p>{' '}
          <p className='mb-4'>
            {' '}
            <b>Метрологическая экспертиза ТПП.</b>
            <p>
              Проверка соответствия обеспечения выбранных средств измерения
              требованиям, определенным в технических условиях (ТУ) на указанные
              изделия.
            </p>
            <p>
              Для выполнения функциональных задач ТПП его элементный состав
              включает:
            </p>
            <p>
              людские ресурсы (руководители, специалисты, технические
              исполнители);
            </p>
            <p>
              материальные ресурсы (основные и вспомогательные материалы,
              канцелярские принадлежности и др.);
            </p>
            <p>
              технические средства (компьютеры, множительная и другая
              оргтехника);
            </p>
            <p>
              экономико-математическое обеспечение (алгоритмы и программы по
              АСТПП, различные математические методы и др.);{' '}
            </p>
            <p>
              информационное обеспечение (стандарты, классификаторы, нормы и
              нормативы и др.).{' '}
            </p>
          </p>{' '}
          <p className='mb-4'>
            Типовая организационная структура* службы ТПП приборостроительного
            предприятия может быть представлена в виде следующей схемы (рис.2).
          </p>
          <img src={i10} />
          <p className='mt-2 mb-4'>
            Рисунок 2 Типовая схема структуры подсистемы ТПП.
          </p>
        </>
      ),
    },
    {
      id: 5,
      title: 'Форма организации технологической подготовки производства',
      titleImage: (
        <img width={90} src={i6} />

      ),
      content: (
        <>
          <ul className='mb-4'>
            <p>
              {' '}
              <b>Различают три формы организации ТПП:</b>
            </p>{' '}
            <li>централизованную</li>
            <li>децентрализованную</li>
            <li>смешанную</li>
          </ul>
          <p className='mb-4'>
            {' '}
            <b>Централизованная</b> - характерна для серийного, крупносерийного и
            массового производства.
            <p>
              Разработка техпроцессов осуществляется в ОГТ, внедрение процессов
              и контроль за соблюдением технологической дисциплины - цеховые
              бюро подготовки производства (БПП).
            </p>
          </p>{' '}
          <p className='mb-4'>
            {' '}
            <b>Децентрализованная</b> - характерна для мелкосерийного
            производства.
            <p>
              Разработка технологических процессов и их внедрение - БПП цехов,
              ОГТ - разработка межцеховых маршрутов, контроль и помощь во
              внедрении процессов.
            </p>
          </p>{' '}
          <p className='mb-4'>
            {' '}
            <b>Смешанная</b> - характерна для серийного производства.
          </p>{' '}
          <p className='mb-4'>
            {' '}
            Централизованная форма ТПП - для постоянной номенклатуры продукции,
            децентрализованная - для продукции разового характера (технические
            услуги сторонним организациям и т.п.)
          </p>{' '}
          <p className='mb-4'>
            {' '}
            Основными направлениями ускорения ТПП в приборостроении являются:
            <p>Максимальная параллельность выполнения всех этапов ТПП;</p>
            <p>
              Унификация технологических процессов, использование групповой
              технологической оснастки;
            </p>
            <p>Максимальная автоматизация и компьютеризация процессов ТПП.</p>
          </p>{' '}
        </>
      ),
    },
    {
      id: 6,
      title: 'Понятие технологической базы и ее выбор',
      titleImage: (
        <img width={90} src={i7} />

      ),
      content: (
        <>
          <p className='mb-4'>
            <b>База</b> – это поверхность или выполняющее ту же функцию сочетание
            поверхностей, ось, точка, принадлежащая заготовке или изделию и
            используемая для базирования.
          </p>

          <p className='mb-4'>
            Для обеспечения неподвижности заготовки или изделия в избранной
            системе координат на них необходимо наложить шесть двусторонних
            геометрических связей, для создания которых необходим комплект баз.
          </p>
          <p className='mb-4'>
            Точка, символизирующая одну из связей заготовки или изделия с
            избранной системой координат, называется опорной точкой. Все опорные
            точки на схеме базирования изображают условными знаками и нумеруют
            порядковыми номерами, начиная с базы, на которой располагается
            наибольшее число опорных точек. Преднамеренная или случайная замена
            одних баз другими с сохранением их принадлежности к конструкторским,
            технологическим или измерительным базам ведет к смене баз.
          </p>
          <p className='mb-4'>
            База, используемая для определения положения заготовки или изделия в
            процессе изготовления или ремонта, называется <b>технологической базой.</b>
          </p>
          <p className='mb-4'>
            База, используемая для определения положения заготовки или изделия
            относительно средств измерения, называется <b>измерительной базой.</b>
          </p>
          <p className='mb-4'>
          База, лишающая заготовку или изделие трех степеней свободы, – перемещения вдоль одной координатной оси и поворотов вокруг двух других, называется <b>установочной базой</b> (наибольшая по площади поверхность детали).
          </p>
          <p className='mb-4'>
          База, лишающая заготовку или изделие двух степеней свободы, – перемещение вдоль одной координатной оси и поворота вокруг другой, называется <b>направляющей базой</b>(наибольшая по протяженности).</p>
          <p className='mb-4'>
          База, лишающая заготовку или изделие одной степени свободы, – перемещения вдоль одной координатной оси, называется <b>опорной базой</b>.
          </p>
          <p className='mb-4'>
          Отклонение фактического положения заготовки или изделия от требуемого, называется <b>погрешностью базирования.</b>
          </p>
          <p className='mb-4'>
          <b>Погрешность установки</b> – это отклонение фактического положения заготовки или изделия от требуемого.
          </p>
          <p className='mb-4'>
          Конструкторские базы назначаются конструктором изделия при простановке размеров на рабочем чертеже. На выбор той или иной схемы при простановке размеров влияют как конструкторские, так и технологические требования. Выбранная схема в значительной степени предопределяет последовательность обработки, выбор баз, конструкцию приспособления и т.д.
          </p>
          <p className='mb-4'>
          Выбирая схему простановки размеров, конструктор должен исходить из обеспечения принципа технологичности конструкции. Более технологичной является та конструкция, на изготовление которой затрачивается меньше времени, требуется более простое приспособление, а заданная точность достигается просто и надежно.
          </p>
          <p className='mb-4'>
          При разработке технологического процесса для каждой операции выбирают исходные базы и проставляют исходные размеры, а также базы для ориентирования заготовки. При неправильном выборе баз заметно увеличивается вспомогательное время на установку и снятие заготовки, усложняется конструкция приспособления. В качестве исходных следует принимать только конструкторские размеры, которые проставлены на чертеже детали.
          </p>
        </>
      ),
    },

    {
      id: 7,
      title: 'Последовательности выполнения технологических операций',
      titleImage: (
        <img width={90} src={i8} />

      ),
      content: (
        <>
          <ol className="mb-4 list-inside list-decimal">
            <p>
            Ограничить деформации в сварных конструкциях можно различными технологическими приемами:
            </p>
            <li>созданием при сборке узла упругих или пластических деформаций, обратных по знаку сварочным деформациям; 
            </li>
            <li>интенсивным охлаждением сварного соединения;
            </li>
            <li>применением скоростной сварки с увеличенной плотностью сварочного тока, обеспечивающей высокую концентрацию теплоты;
            </li>
            <li>
            рациональной последовательностью выполнения сборочно-сварочных операций и т. п.
            </li>
          </ol>
          <p className="mb-4">
          Значительное влияние на точность сварного узла может оказать последовательность наложения швов. Поэтому с целью уменьшения деформаций конструкции от сварочных напряжений порядок сварки должен быть четко регламентирован. Так, сварку рам тележек локомотивов ведут два сварщика параллельно с обеих сторон рамы; сварка главной рамы ведется от ее середины к концам одновременно четырьмя сварщиками. При выполнении швов большой длины короблений можно избежать, применив обратноступенчатую сварку, т. е. накладывая швы следующими один за другим участками в направлении, обратном общему приращению шва (рис. 3).
          </p>
          <img src={i11} />
          <p className="mt-2 mb-4">
          Рис. 3. Схема обратноступенчатой сварки
          </p>
          <p className="mb-4">
          Необходимо также иметь в виду, что деформации могут быть увеличены при неправильном кантовании, транспортировании и хранении сварных конструкций, особенно крупных и недостаточно жестких.
          </p>
          <p className="mb-4">
          Последовательность выполнения сборочно-сварочных операций зависит от конструктивных особенностей сварного узла, заданной точности конструкции, технологических особенностей выбранного способа сварки, удобства выполнения операций и типа производства.
          </p>
          <p className="mb-4">
          Правильно выбранная последовательность сборки и сварки обеспечивает повышение точности изготавливаемого узла вследствие минимальных деформаций, а следовательно, уменьшение затрат на исправление деформированных конструкций . Последовательность сварки влияет также на прочность сварного узла. Так, предел выносливости при переменных нагрузках может быть повышен в результате наложения швов сварных соединений в последовательности, благодаря которой в опасных зонах конструкции возникают остаточные напряжения сжатия. Влияние концентраторов напряжений можно снизить путем создания в опасной зоне поля напряжений обратного знака при помощи местного нагрева или наложения холостых валиков.
          </p>
          <ol className="mb-4 list-inside list-decimal">
            <p>
            При построении технологического процесса сборочно-сварочных работ возможны следующие схемы:
            </p>
            <li>полная сборка узла или конструкции с последующей сваркой;
            </li>
            <li>последовательная сборка и сварка конструкции наращиванием отдельных элементов;
            </li>
            <li>сборка и сварка узлов, а затем сборка и сварка конструкции из узлов.
            </li>
          </ol>
          <img src={i12} />
          <p className="mt-2 mb-4">
            <b>
            Первую схему
            </b> используют для изготовления простых узлов, состоящих из двух-трех заготовок, а также конструкций средней сложности, в технологических процессах изготовления которых имеется несколько сварочных операций.
          </p>
          <p className="mb-4">
            <b>
           По второй схеме
            </b> конструкции изготавливаются в тех случаях, когда сварка полностью собранного изделия невозможна, а использование третьей схемы не обеспечивает заданной точности конструкции из-за ее недостаточной жесткости. Требуемая точность изготовления конструкции по второй схеме достигается промежуточными операциями правки. Производительность сборочно-сварочных работ сравнительно невысокая.
          </p>
          <p className="mb-4">
            <b>
            Третья схема
            </b> используется для изготовления сложных пространственных конструкций больших размеров. Укрупнение отдельных элементов сварной конструкции в узлы с последующей сборкой и сваркой всего изделия обеспечивает доступность сварных соединений, удобство их выполнения и операционного контроля, облегчает использование высокопроизводительной технологической оснастки. Представляется также возможным производить параллельную сборку и сварку отдельных узлов, что сокращает производственный цикл изготовления сварной конструкции. 
          </p>
          <p className="mb-4">
          Кроме того, общая деформация всей конструкции в условиях изготовления по третьей схеме может получиться меньшей (с учетом правки деформированных узлов, которая осуществляется легче, чем правка полностью сваренной конструкции). Однако малая жесткость отдельных составных частей сварной конструкции может привести при поузловом изготовлении к возрастанию деформаций от сварки. С позиции уменьшения сварочных деформаций сборка всей конструкции сразу (без расчленения на узлы) в ряде случаев оказывается более целесообразной.
          </p>
          <p className="mb-4">
          Третья схема построения сборочно-сварочных работ широко используется в локомотивостроения при изготовлении главных рам, кузовов, рам тележек и т. д., причем отдельные узлы этих конструкций могут изготавливаться по первой схеме.
          </p>
          <p className="mb-4">
          Преимущества первой схемы — облегчение станочной обработки и разгрузка крупных станков; недостаток — трудность обеспечения точности сварной конструкции; предметы производства — узлы невысокой точности с малым объемом сварки или очень крупные узлы.
          </p>
          <p className="mb-4">
          Достоинствами второй схемы являются точность и неизменяемость размеров и геометрической формы узла, отсутствие в конструкции внутренних сварочных напряжений; ее недостатки — высокая трудоемкость и длительность производственного цикла; область применения второй схемы — точные конструкции, узлы с большим объемом сварки.
          </p>
          <p className="mb-4">
          В третьей схеме вследствие расчленения обработки резанием последняя упрощается при повышении производительности и уменьшении загрузки крупных станков; недостаток схемы — усложнение технологического пути заготовок; область применения — крупные узлы высокой точности.
          </p>
          <p className="mb-4">
          Технологические процессы изготовления сварной конструкции следует разрабатывать одновременно с ее проектированием. На стадии разработки технического проекта изделия принимаются наиболее принципиальные и общие технологические решения с учетом технико-экономического сравнения вариантов технологического процесса. Принятые решения затем уточняются и конкретизируются при разработке рабочей конструкторской документации. В этот период определяются содержание и последовательность операций технологического процесса, методы контроля и испытаний сварной конструкции, устанавливаются необходимые средства технологического оснащения, назначаются соответствующие технологические режимы, производится нормирование технологической трудоемкости и т. п.
          </p>
        </>
      ),
    },
    
  ],
};
